Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་བྱིས་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་དག་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་རབ་ཏུ་བསྐྱེད་དེ། རིམ་གྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་འཐོབ་པར་འགྱུར་རོ། །
en: Then the ṛṣi Bhīṣmottara­nirghoṣa said to those youths, “Young men, when someone has developed the aspiration for the highest, complete enlightenment and practices bodhisattva conduct, they create happiness for all beings and will eventually attain omniscience.

source: བྱིས་པ་དག་རིགས་ཀྱི་བུ་འདིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་སྟེ། དེ་བས་ན་འདི་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་སྦྱོང་བར་འགྱུར་རོ། །
en: Young men, this noble one has developed the aspiration for the highest, complete enlightenment, and therefore he will bring to completeness all the qualities of buddhahood.

source: དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱི་མི་ཐུབ་པའི་རྒྱལ་མཚན་ཐོབ་པའོ། །
en: Then the ṛṣi Bhīṣmottara­nirghoṣa said to Sudhana, the head merchant’s son, “Noble one, I have attained the bodhisattva liberation called the banner of being invincible to others.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པ་འདིའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས། །
en: Sudhana asked, “What is the scope of this bodhisattva liberation called the banner of being invincible to others?”

source: དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་མགོ་ལ་བྱུགས་ནས་ལག་པ་གཡས་པས་བཟུང་ངོ་། །ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་ལག་པ་གཡས་པས་བཟུང་མ་ཐག་ཏུ་དེའི་མོད་ལ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། ཕྱོགས་བཅུར་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་མཐོང་བར་གྱུར་ཏེ། དེ་དག་གི་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་བདག་ཉིད་འདུག་པར་ཤེས་པར་གྱུར་ཏོ། །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཀྱང་རྣམ་པ་གྲངས་མེད་པར་རྣམ་པར་དག་པའི་རྒྱན་དང་ལྡན་པར་མཐོང་ངོ་། །དེ་དག་ནའང་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཁ་དོག་སྣ་ཚོགས་ཅན་རྒྱན་རྣམ་པ་ཐ་དད་པ་དང་ལྡན་པ་དག་འཁོད་པ་མཐོང་ངོ་། །
en: The ṛṣi Bhīṣmottara­nirghoṣa extended his right hand and with it stroked and held the head of Sudhana, the head merchant’s son.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་དག་ན་འང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཚན་དང་དཔེ་བྱད་བཟང་པོ་འབར་བས་བརྒྱན་པ་དག་བཞུགས་པ་མཐོང་ངོ་། །དེ་དག་ལས་ཀྱང་ཚིག་དང་ཡི་གེ་གཅིག་ལས་ཀྱང་ཕྱིར་ཕྱོགས་པ་མེད་པར་ཆོས་བསྟན་པ་ཉན་ཏོ། །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་དེ་དག་ཀྱང་ཕན་ཚུན་མ་འདྲེས་པར་ཡང་དག་པར་འཛིན་ཏོ། །ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་སེམས་ཅན་གྱི་བསམ་པ་སྣ་ཚོགས་ལ་འབབ་པ་དེ་དག་ཀྱང་ཡང་དག་པར་འཛིན་ཏོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྔོན་གྱི་སྨོན་ལམ་མོས་པ་སྣ་ཚོགས་ཀྱི་སྟོབས་ཀྱིས་རྣམ་པར་སྦྱངས་པ་རྒྱ་མཚོ་ལ་ཡང་ཞུགས་སོ། །སངས་རྒྱས་ཀྱི་ཡང་དག་པར་བསྡུ་བ་སྨོན་ལམ་སྣ་ཚོགས་རྒྱ་མཚོས་རྣམ་པར་དག་པ་རྒྱ་མཚོ་དེ་དག་ལ་ཡང་ཞུགས་སོ། །སངས་རྒྱས་ཀྱི་སྐུ་མདོག་སེམས་ཅན་གྱི་བསམས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་འགྱུར་བར་རྣམ་པར་དམྱིགས་པ་དེ་དག་ཀྱང་མཐོང་ངོ་། །སངས་རྒྱས་ཀྱི་འོད་གཟེར་གྱི་དྲ་བ་འདོད་ཆགས་དང་བྲལ་བ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་དག་པའི་རྒྱན་གྱི་དཀྱིལ་འཁོར་དེ་དག་ཀྱང་མཐོང་ངོ་། །སངས་རྒྱས་ཀྱི་སྟོབས་དེ་དག་ལའང་ཡེ་ཤེས་རྣམ་པར་སྣང་བ་བསྒྲིབས་པ་མེད་པ་དང་ལྡན་པས་ཞུགས་སོ། །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་སྣང་བར་གྱུར་པ།
en: As soon as the ṛṣi Bhīṣmottara­nirghoṣa held the head of Sudhana, the head merchant’s son, with his right hand, Sudhana, the head merchant’s son, saw in the ten directions buddha realms as numerous as the atoms in a million buddha realms; he perceived himself to be sitting at the feet of buddhas as numerous as the atoms in a million buddha realms; he saw the countless pure displays of forms within those buddha realms; he saw the ocean of the multicolored display of the circles of followers of those tathāgatas; he saw in the midst of those oceans of the circles of followers the bodies of the tathāgatas, which were adorned with the shining signs and features of a great being; he listened to their Dharma teachings without missing a single word or term; he obtained those Dharma wheels of the tathāgatas, each distinct from the other; he received the rain of Dharma that fell according to the various aspirations of beings; and he comprehended an ocean of the past prayers of those tathāgatas, which were purified by the power of various aspirations; he also comprehended those pure oceans of various prayers, which were oceans that had been accumulated by the buddhas; he also saw the perception of the colors of the bodies of the buddhas that satisfied beings in accordance with their wishes; he also saw the network of light rays from the buddhas as various passionless, pure displays of halos; and he also perceived the strengths of those buddhas that possessed the unobscured radiance of wisdom.

source: ཏིང་ངེ་འཛིན་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་སྣང་བ་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་ཡེ་ཤེས་མྱི་ཟད་པའི་རྣམ་པར་ཐར་པ་དང་ལྡན་པ། གཟུངས་ཀྱི་སྒོ་སྣང་བ་ཕྱོགས་ཀུན་གྱི་དྲ་བ་རབ་ཏུ་ཐོབ་པ། གཟུངས་ཀྱི་སྒོ་རྡོ་རྗེའི་སྙིང་པོས་སེམས་རབ་ཏུ་གསལ་བར་བྱས་པ། ཏིང་ངེ་འཛིན་ཡེ་ཤེས་བརྩེགས་པ་རྣམ་པར་ཕྱེ་བའི་ཡུལ་ལ་རྣམ་པར་ཕྱེ་བ་རབ་ཏུ་ཐོབ་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་གཞི་ཀུན་ནས་རྣམ་པར་བརྒྱན་པའི་སྙིང་པོ་ཡུལ་དུ་གྱུར་པ། ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་སངས་རྒྱས་ནམ་མཁའི་སྙིང་པོའི་དཀྱིལ་འཁོར་ལ་རབ་ཏུ་ཞུགས་པ། ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་མུ་ཁྱུད་ཀྱིས་སེམས་རབ་ཏུ་སྣང་བར་བྱས་པ། ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་དུས་གསུམ་གྱི་ཡེ་ཤེས་རིན་པོ་ཆེ་མི་ཟད་པའི་དཀྱིལ་འཁོར་ལ་རབ་ཏུ་བརྩོན་པ་དེས་དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞབས་ཀྱི་དྲུང་དུ་ནི་ཉིན་ཞག་གཅིག་ལོན་པར་ཤེས་སོ། །
en: In that way, he was illuminated by the light of wisdom from the bodhisattva liberation called the banner of being invincible to others; he attained the illumination of the samādhi called the essence of the sun; he possessed the samādhi called the liberation of unceasing wisdom; he obtained the sight of the gateway of retention called the network in all directions; he attained the samādhi called the range of the summit of well-ordered knowledge; he had the range of dwelling in the perfection of wisdom, which is the path with the complete array of foundations; he gained the light of the samādhi called the buddhas’ domain of the essence of space; his mind was illuminated by the samādhi called the rim of the Dharma wheel of all the buddhas; and he attained the light of the samādhi called the domain of the unceasing precious knowledge of the three times.

source: ལ་ལར་ནི་ཉིན་ཞག་བདུན་ལོན་པ་སྙམ། ལ་ལར་ནི་ཟླ་བ་ཕྱེད་ལོན་པ་སྙམ། ལ་ལར་ནི་ཟླ་བ་གཅིག་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་གཅིག་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བརྒྱར་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་བརྒྱ་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་ཕྱེད་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་གཅིག་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བརྒྱ་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ་བྱེད་པ་ནས། དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞབས་ཀྱི་དྲུང་དུ་ནི་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་སྙེད་ལོན་པར་གྱུར་པ་སྙམ་བྱེད་དེ། དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞབས་ཀྱི་དྲུང་དུ་ནི་བསྐལ་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལོན་པ་སྙམ་བྱེད་པ་ནས། བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལོན་པ་སྙམ་བྱེད་པར་གྱུར་ཏོ། །
en: He perceived sitting at the feet of some tathāgatas for one day and night, at the feet of some for seven days, at the feet of some for half a month, at the feet of some for one month, at the feet of some for one year, at the feet of some for a hundred years, at the feet of some for a thousand years, at the feet of some for a hundred thousand years, at the feet of some for ten million years, at the feet of some for a billion years, at the feet of some for ten billion years, at the feet of some for a trillion years, at the feet of some for a quintillion years, at the feet of some for half a kalpa, at the feet of some for one kalpa, at the feet of some for a hundred kalpas, at the feet of some for a thousand kalpas, at the feet of some for a hundred thousand kalpas, at the feet of some for ten million kalpas, at the feet of some for a billion kalpas, at the feet of some for ten billion kalpas, at the feet of some for a trillion kalpas, at the feet of some for a quintillion kalpas, at the feet of some for an anabhilāpyānabhilāpya­parivarta of kalpas, at the feet of some tathāgatas for as many kalpas as there are atoms in Jambudvīpa, and so on up to at the feet of some tathāgatas for as many kalpas as there are atoms in an anabhilāpyānabhilāpya­parivarta of buddha realms.

source: དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཏང་བ་དང་། དེས་ཡང་བདག་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱི་མདུན་དུ་འདུག་པར་ཤེས་པར་གྱུར་ཏོ། །
en: Then the ṛṣi Bhīṣmottara­nirghoṣa released Sudhana, the head merchant’s son, and Sudhana perceived again that he was sitting at the feet of the ṛṣi Bhīṣmottara­nirghoṣa.

source: དེ་ལ་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་སྨྲས་པ་རིགས་ཀྱི་བུ་དྲན་མོད།
en: The ṛṣi Bhīṣmottara­nirghoṣa asked him, “Noble one, do you remember?”

source: སྨྲས་པ་འཕགས་པ་དགེ་བའི་བཤེས་གཉེན་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་དྲན་ནོ། །
en: Sudhana replied, “Ārya, I remember the blessing of the kalyāṇamitra.”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་འདི་ཤེས་པར་ཟད་ན། བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པ། དུས་ཐམས་ཅད་དུ་འཁོར་ལོ་བསྐོར་བ། སངས་རྒྱས་ཀྱི་མཚན་དང་། ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ།
en: The ṛṣi Bhīṣmottara­nirghoṣa said, “Noble one, I know only this bodhisattva liberation called the banner of being invincible to others.

source: དེ་བཞིན་གཤེགས་པ་བྱུང་བའི་ཉི་མ་ལ་རྣམ་པར་དམིགས་པའི་རྒྱན་རབ་ཏུ་དགོད་པ་དུས་གསུམ་གྱི་ཡུལ་སྐད་གཅིག་གི་ཡེ་ཤེས་སུ་ཡང་དག་པར་སྡུད་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ལུས་ཤིན་ཏུ་རྣམ་པར་བཀྲམ་པ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ལ་ཡེ་ཤེས་སྣང་བའི་རང་བཞིན་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་མངོན་པར་ལངས་པ། སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྤྱོད་པས། རྣམ་པར་སྤྱོད་པ་དང་མཐུན་པའི་ཚུལ་དང་ལྡན་པ་འདོད་པ་བཞིན་དུ་ཀུན་ཏུ་སྣང་ཞིང་དྲི་མ་མེད་ལ་འོད་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པའམ། སྨོན་ལམ་གྱི་ཁྱད་པར་སྨོས་པའམ། ཞིང་གི་མངོན་པར་འདུ་བྱ་བ་ཤེས་པའམ། ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་འཇུག་པར་བྱ་བའམ། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའམ། རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པར་བྱ་བའམ།
en: How could I know or describe the qualities, indicate the different prayers, know the formation of realms, comprehend the scope of the wisdom, follow the range of the samādhis, comprehend the miracles and emanations that follow the arising of the might and display of the powerful liberations, grasp the characteristics of the different bodies, describe the pure domain of the voices, or teach the radiance of the wisdom of the bodhisattvas who have attained the samādhis that have the clairvoyant knowledge that is superior to all beings, who have power over the wheel of time, who are skilled in the accomplishment of the knowledge of the signs of buddhahood, who perceive the display of the rising of the sun of the tathāgatas, who have accumulated the knowledge of the single characteristic of the range of the three times, who have bodies that are distributed through all world realms, who have bodies of wisdom that illuminate the entire realm of phenomena, who appear in accordance with the wishes of all beings, who practice an appropriate conduct in a way that is in accordance with the aspirations of beings, who shine in a way that delights, and who have the pure domain of stainless radiant wisdom?

source: རྣམ་པར་ཐར་པའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་རྩེ་བའི་རྗེས་སུ་འབྲང་བར་བྱ་བའམ། ལུས་རྣམ་པར་ཕྱེ་བའི་མཚན་མ་གཟུང་བར་བྱ་བ་འམ། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ་བརྗོད་པ་འམ།
en: “Depart, noble one.

source: ཡེ་ཤེས་ཀྱི་སྣང་བ་རབ་ཏུ་བསྟན་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་ཡོངས་སུ་ཚོལ་བ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཅེས་བྱ་བ་འདུག་གིས།
en: In this southern region, in the land called Īṣāṇa, there dwells a brahmin by the name of Jayoṣmāyatana.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དྲིས་ཤིག །
en: How should a bodhisattva practice it?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Then Sudhana, the head merchant’s son, was overjoyed, pleased, happy, and content.

source: དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ་དྲང་སྲོང་འཇིག་མཆོག་དབྱངས་ཀྱི་དྲུང་ནས་སོང་ངོ་།
en: He bowed his head to the feet of the ṛṣi Bhīṣmottara­nirghoṣa, circumambulated the ṛṣi Bhīṣmottara­nirghoṣa, keeping him to his right, many hundreds of thousands of times, and, looking back again and again, departed from the ṛṣi Bhīṣmottara­nirghoṣa.

source: སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་སུམ་ཅུ་གཉིས་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ཡེ་ཤེས་ཀྱིས་སྣང་བར་བྱས་པ།
en: Jayoṣmāyatana Chapter 12 Sudhana, the head merchant’s son, was illuminated by the wisdom of the bodhisattva liberation called the banner of being invincible to others.

source: སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་སུམ་དུ་རྣམ་པར་སྤྱོད་པ།
en: He dwelled in the direct experience of the inconceivable range of the miraculous manifestations of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་མངོན་སུམ་གྱི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་ཤེས་པ།
en: He perceived the direct knowledge of inconceivable bodhisattva liberations.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་ཀྱིས།
en: His mind was illuminated by the wisdom of inconceivable bodhisattva samādhis.

source: སེམས་སྣང་བར་གྱུར་པ་དུས་ཐམས་ཅད་དུ་ཡང་དག་པར་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the radiance of the wisdom of samādhi that is present at all times.

source: འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལ་ཡང་དག་པར་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་གྱིས་སྣང་བར་གྱུར་པ།
en: He was illuminated by the range of samādhi, in which all perceptions are present and included.

source: འགྲོ་བ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་སྣང་བ་ཐོབ་པ།
en: He had obtained the light of the wisdom that transcends all worlds.

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་སྤྱོད་ཡུལ་ལ་རྣམ་པར་སྤྱོད་པ་མངོན་ཏུ་གྱུར་པ།
en: He had the direct perception of dwelling in the entire range of the three times.

source: གཉིས་སུ་རྣམ་པར་རྟོག་པ་མེད་པས་མཉམ་པ་ཉིད་དུ་བསྟན་པའི་ཡེ་ཤེས་ལྷུར་ལེན་པ།
en: He was devoted to the wisdom that teaches equality without dualistic conceptions.

source: དམྱིགས་པ་ཐམས་ཅད་ལ་རབ་ཏུ་འདལ་བའི་ཡེ་ཤེས་སྣང་བ་དང་ལྡན་པ།
en: He had the light of wisdom that pervaded throughout all objects of perception.

source: མཉམ་པ་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པའི་བཟོད་པ་རྣམ་པར་དག་པ་ལ་མོས་པའི་མཛོད་ལ་མཁས་པ་རང་བཞིན་གྱི་ཆོས་ལ་བཟོད་པ་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པ།
en: He had mastered the treasury of aspiration for pure patience toward all that is heard. He had attained the definitive wisdom of patience for natural phenomena.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རང་བཞིན་བསྒོམ་པ་དང་མི་འབྲལ་བའི་སེམས་དང་ལྡན་པ།
en: His mind was never apart from meditation on the nature of the bodhisattva conduct of higher cognition.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་དྲག་པོ་ལས་ཕྱིར་མི་ལྡོག་པའི་སེམས་དང་ལྡན་པ།
en: His mind was irreversibly progressing toward the power of omniscience.

source: སྟོབས་བཅུའི་ཡེ་ཤེས་སྣང་བའི་འོད་རབ་ཏུ་ཐོབ་པ།
en: He had attained the illumination of the knowledge of the ten strengths.

source: ཆོས་ཀྱི་དབྱིངས་བརྗོད་པ་ལ་མངོན་པར་མོས་པས། ངོམས་པ་མེད་པའི་སེམས་དང་ལྡན་པ།
en: His mind was never content in its aspiration to hear the sound of the words of the realm of Dharma.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྣམ་པར་སྤྱོད་པའི་སྤྱོད་ཡུལ་ལ་འཇུག་པ་ཁོང་དུ་ཆུད་པའི་སེམས་དང་ལྡན་པ།
en: His mind had gained entry into the field of dwelling in omniscience.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱན་མཐའ་ཡས་པ་མངོན་པར་བསྒྲུབ་པའི་སེམས་དང་ལྡན་པ།
en: His mind had attained the infinite display of bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་མཐའ་ཡས་པ། རྣམ་པར་སྤྱད་པའི་སེམས་དང་ལྡན་པ།
en: His mind was purified by the infinite domain of great bodhisattva prayers.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དྲ་བ་མི་ཟད་པ། ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་མཐའ་དང་དབུས་མེད་པ་མངོན་དུ་གྱུར་པའི་སེམས་དང་ལྡན་པ།
en: He had the mind with direct perception of the limitless knowledge without limit or center of the unceasing network of world realms.

source: སེམས་ཅན་རྒྱ་མཚོ་མཐའ་ཡས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བ་ལ་ཞུམ་པ་མེད་པའི་སེམས་དང་ལྡན་པ་དེས།
en: He had the mind that never wearies in ripening and guiding the infinite ocean of beings.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཡུལ་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the infinite range of bodhisattva conduct.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་ཕྱེ་བ་སྣ་ཚོགས་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the infinite diversity of the different world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པ་དམྱིགས་པ་ཕྲ་བ་དང་། ཡངས་པའི་ཁོངས་སུ་ཆུད་པར་བྱ་བ་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the small and the vast objects of perception included within the infinite world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གཞི་མཐའ་ཡས་པའི་མིང་གི་དྲ་བ་སྣ་ཚོགས་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the various networks of names that are the bases for infinite world realms.

source: འཇིག་རྟེན་གྱི་ཁམས་སུ་རྣམ་པར་སྤྱད་པ། རྣམ་པར་གདགས་པ་མཐའ་ཡས་པའི་ཀུན་རྫོབ་རྣམ་པ་ཐ་དད་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the various infinite, differing relative designations and terms for infinite world realms.

source: སེམས་ཅན་གྱི་མོས་པ་སྣ་ཚོགས་མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the infinite, differing aspirations of beings.

source: སེམས་ཅན་རྣམ་པར་ཕྱེ་བའི་རྣམ་པ་ཐ་དད་པ། མཐའ་ཡས་པ་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the infinite, differing categories of beings.

source: སེམས་ཅན་མཐའ་ཡས་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the infinite practices for guiding and ripening beings.

source: སེམས་ཅན་དང་ཕྱོགས་དང་དུས་མཐའ་ཡས་པའི་མྱིང་གི་རྣམ་པ་སྣ་ཚོགས་ལ་ཡང་དག་པར་བལྟ་བ་དང་།
en: He saw the various infinite perceptions of the directions and times of beings.

source: དགེ་བའི་བཤེས་གཉེན་མངོན་དུ་བྱ་བ་བྱེད་ཅིང་མཐར་གྱིས་ཡུལ་ཚོལ་བ་དང་ལྡན་པ་གང་ན་བ་དང་། བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ག་ལ་བ་དེར་ཕྱིན་ཏོ། །
en: Focused on the kalyāṇamitra, Sudhana eventually arrived in the land called Īṣāṇa and went to where the brahmin Jayoṣmāyatana was.

source: དེའི་ཚེ་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྒྲུབ་པའི་གཞིར་བྱས་ཤིང་དཀའ་ཐུབ་དྲག་པོ་ལ་སྤྱོད་དེ།
en: At that time, the brahmin Jayoṣmāyatana was practicing the basis for accomplishing omniscience and practicing extreme asceticism.

source: དེའི་ཕྱོགས་བཞི་ནས་མེའི་ཕུང་པོ་རི་རབ་ཙམ་དུ་ཆེ་བ་བུས་པ་དང་།
en: On all four sides of himself he had lit fires the size of mountains.

source: རི་ཤིན་ཏུ་མཐོ་བའི་གཡང་སའི་ལམ་གྱི་རྒྱུད་སྤུ་གྲིའི་སོས་གཤིབས་པས་འཁོད་པར་སྣང་ངོ་།
en: Towering above was the precipice of a great mountain with a path of razors leading up it.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the brahmin Jayoṣmāyatana, sat down before him, and with his hands together in homage said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སྤྱད་པ་དང་།
en: How does a bodhisattva train in bodhisattva conduct?

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Ārya, I have heard that you teach and give instructions to bodhisattvas.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: Therefore, Ārya, teach me how bodhisattvas train in bodhisattva conduct and in what way they practice it!”

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ་དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་སོང་ལ་སྤུ་གྲིའི་སོ་དངར་བའི་རི་འདི་ལ་འཛེགས་ཏེ། མེའི་འོབས་འདིར་མཆོངས་ཤིག་དང་།
en: The brahmin Jayoṣmāyatana said, “Noble one, go and climb up this mountain on the path of razors and then jump down into this fire.

source: དེས་ཁྱོད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་འགྱུར་རོ་ཞེས་ནས།
en: In that way, your bodhisattva conduct will become pure.”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། མི་ཁོམ་པ་བརྒྱད་ལས་རྣམ་པར་ལྡོག་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: Sudhana, the head merchant’s son, thought, “It is rare to avoid the eight unfavorable existences.

source: མྱིར་གྱུར་ཏེ་ཁོམ་པ་ཕུན་སུམ་ཚོགས་ཤིང་།
en: It is rare to become a human.

source: རྣམ་པར་དག་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have pure good fortune.

source: སངས་རྒྱས་འབྱུང་བ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have the appearance of a buddha.

source: དབང་པོ་ཉམས་པ་མྱེད་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have unimpaired senses.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐོས་པ་ཡང་ཤིན་དུ་དཀོན།
en: It is rare to hear the Buddhadharma.

source: སྐྱེས་བུ་དམ་པ་དང་ཕྲད་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to meet a higher being.

source: ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have the friendship of a true kalyāṇamitra.

source: ཡང་དག་པའི་ཚུལ་རྗེས་སུ་བསྟན་པས་ལེགས་པར་སྡུད་པ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to gain the teaching of the true way.

source: ཡང་དག་པར་འཚོ་བར་བྱ་བ་ཡང་ཤིན་ཏུ་དཀོན།
en: It is rare to have a right livelihood.

source: མིའི་འཇིག་རྟེན་ན་ཆོས་དང་གཉེར་བའི་ཆོས་ལ་ནན་ཏན་བྱེད་པ་ཡང་ཤིན་ཏུ་དཀོན་ན།
en: It is rare in the human world to practice the Dharma and the ancillary Dharmas.

source: དེ་སྐད་ཟེར་ཞིང་བདག་གི་དགེ་བའི་བར་ཆད་ལ་ཞུགས་ལ་དེ་ལྟར་བདག་གི་སྲོག་གཅད་པར་བརྩོན་པ་འདི་བདུད་དམ་ཅིག་མ་ཡིན་ནམ།
en: “This person who will create an obstacle to my roots of merit, who urges me to kill myself, is he a māra?

source: བདུད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་འམ།
en: Is he blessed by a māra?

source: བདུད་ཀྱི་རིས་སུ་གཏོགས་པའམ།
en: Is he a follower of Māra?

source: དགེ་བའི་བཤེས་གཉེན་ལྟར་བརྫུས་པའམ།
en: Is he pretending to be a kalyāṇamitra?

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མྱི་གཅགས་པ་བྱེད་པ་ཞིག་མ་ཡིན་གྲང་།
en: Is he someone who destroys bodhisattvas?

source: བདག་གི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བགེགས་བྱེད་པར་འདོད་པ་ཞིག་མ་ཡིན་གྲང་།
en: Does he wish to prevent me from attaining omniscience?

source: བདག་ལམ་གོལ་བ་ངན་པར་གཞུག་པར་འདོད་པ་ཞིག་མ་ཡིན་གྲང་།
en: Does he wish to lead me down a wrong path?

source: བདག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ལ་བགེགས་བྱེད་པ་ཞིག་མ་ཡིན་གྲང་།
en: Is he creating an obstacle to the gateway of the Dharma through which one realizes the Buddhadharma?”

source: སྙམ་ནས། དེ་དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པའི་ཚེ། ཚངས་པ་སྟོང་ཕྲག་བཅུ་སྟེང་གི་བར་སྣང་ལ་གནས་ཏེ། འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་དེ་ལྟ་བུའི་སེམས་མི་བརྟན་པར་མ་བྱེད་ཅིག །
en: When Sudhana had these thoughts, ten thousand Brahmās who were up in the sky said to him, “Noble one, do not be unrelenting in these thoughts!

source: རིགས་ཀྱི་བུ་འཕགས་པ་འདི་ནི་ཏིང་ངེ་འཛིན་རྡོ་རྗེ་འོད་འཕྲོ་བའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ་སྟེ།
en: This ārya has attained the illumination of the samādhi vajra light rays.

source: བརྩོན་འགྲུས་ལྡོག་པ་མེད་པའོ། །
en: He has unwavering diligence.

source: བརྩམས་པ་ཆེན་པོ་མཐར་དབྱུང་བ་ལ་ཞུགས་པའོ། །
en: He has set out on the greatest undertaking.
